**`CIC1A-6`**

In [3]:
import pandas as pd

## **Clean Age Distribution Dataset**

**`CIC1A-7`**

In [17]:
age_df = pd.read_csv(r"..\data\raw\agedistribution_2016_estimates.csv")
age_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21 entries, 0 to 20
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     21 non-null     object
 1   M       21 non-null     float64
 2   F       21 non-null     float64
 3   Tot     21 non-null     float64
dtypes: float64(3), object(1)
memory usage: 804.0+ bytes

In [5]:
age_df.sample(5)

      Age     M     F   Tot
20    65+   4.9   5.4   5.4
0     0-4   8.7   8.2   8.5
15  75-79   0.8   0.9   0.9
17    85+   0.2   0.3   0.3
19  15-64  67.5  68.2  67.8

**`CIC1A-8`**

In [6]:
age_df.describe(include="all")

        Age          M          F        Tot
count    21  21.000000  21.000000  21.000000
unique   21        NaN        NaN        NaN
top     0-4        NaN        NaN        NaN
freq      1        NaN        NaN        NaN
mean    NaN   9.523810   9.523810   9.542857
std     NaN  14.529243  14.571236  14.527752
min     NaN   0.200000   0.300000   0.300000
25%     NaN   3.000000   3.100000   3.100000
50%     NaN   6.100000   6.100000   6.100000
75%     NaN   9.500000   9.400000   9.600000
max     NaN  67.500000  68.200000  67.800000

In [7]:
# null values
age_df.isna().sum()

Age    0
M      0
F      0
Tot    0
dtype: int64

In [8]:
age_df.dtypes

Age     object
M      float64
F      float64
Tot    float64
dtype: object

**`CIC1A-9`**

In [9]:
age_df.head(2)

     Age    M    F  Tot
0    0-4  8.7  8.2  8.5
1  9-May  9.1  8.8  8.9

In [10]:
# rename column names to more readable

age_df = age_df.rename(columns={
    "Age" : "age_distribution",
    "M" : "male",
    "F" : "female",
    "Tot" : "total"
})

age_df.head()

  age_distribution  male  female  total
0              0-4   8.7     8.2    8.5
1            9-May   9.1     8.8    8.9
2           14-Oct   9.8     9.4    9.6
3            15-19  10.4     9.9   10.1
4            20-24  10.2    10.7   10.4

**`CIC1A-10`**

In [11]:
age_df["age_distribution"].unique()

array(['0-4', '9-May', '14-Oct', '15-19', '20-24', '25-29', '30-34',
       '35-39', '40-44', '45-49', '50-54', '55-59', '60-64', '65-69',
       '70-74', '75-79', '80-84', '85+', '0-14', '15-64', '65+'],
      dtype=object)

In [12]:
# map the 'May' into 5 and 'Oct' into 10

age_df["age_distribution"] = age_df["age_distribution"].replace({
    "May" : "5",
    "Oct" : "10"
}, regex=True
)

age_df["age_distribution"].unique()

array(['0-4', '9-5', '14-10', '15-19', '20-24', '25-29', '30-34', '35-39',
       '40-44', '45-49', '50-54', '55-59', '60-64', '65-69', '70-74',
       '75-79', '80-84', '85+', '0-14', '15-64', '65+'], dtype=object)

**`CIC1A-11`**

In [13]:
age_df

   age_distribution  male  female  total
0               0-4   8.7     8.2    8.5
1               9-5   9.1     8.8    8.9
2             14-10   9.8     9.4    9.6
3             15-19  10.4     9.9   10.1
4             20-24  10.2    10.7   10.4
5             25-29   9.5     9.8    9.7
6             30-34   8.1     8.0    8.1
7             35-39   7.0     7.2    7.1
8             40-44   6.1     6.1    6.1
9             45-49   5.3     5.4    5.3
10            50-54   4.4     4.3    4.3
11            55-59   3.5     3.7    3.6
12            60-64   3.0     3.1    3.1
13            65-69   2.1     2.2    2.2
14            70-74   1.4     1.5    1.5
15            75-79   0.8     0.9    0.9
16            80-84   0.4     0.5    0.5
17              85+   0.2     0.3    0.3
18             0-14  27.6    26.4   27.0
19            15-64  67.5    68.2   67.8
20              65+   4.9     5.4    5.4

- as you can see, the last 3 rows are duplicate info. Its just 3 split of the age group, we don't want that

In [14]:
age_df = age_df.iloc[:18]
age_df

   age_distribution  male  female  total
0               0-4   8.7     8.2    8.5
1               9-5   9.1     8.8    8.9
2             14-10   9.8     9.4    9.6
3             15-19  10.4     9.9   10.1
4             20-24  10.2    10.7   10.4
5             25-29   9.5     9.8    9.7
6             30-34   8.1     8.0    8.1
7             35-39   7.0     7.2    7.1
8             40-44   6.1     6.1    6.1
9             45-49   5.3     5.4    5.3
10            50-54   4.4     4.3    4.3
11            55-59   3.5     3.7    3.6
12            60-64   3.0     3.1    3.1
13            65-69   2.1     2.2    2.2
14            70-74   1.4     1.5    1.5
15            75-79   0.8     0.9    0.9
16            80-84   0.4     0.5    0.5
17              85+   0.2     0.3    0.3

In [ ]:
import os

os.makedirs("../data/cleaned/")
age_df.to_csv("../data/cleaned/cleaned_age_distribution.csv", index=False)

## **Death and Recovery Data cleaning**

In [18]:
death_recov_df = pd.read_csv(r"..\data\raw\death_and_recovery.csv")
death_recov_df.head()

,Age,Gender,Patient_status,City,State,comorbidity,State_code
0,70,M,Deceased,Mumbai,Maharashtra,diabetes,MH
1,85,M,Deceased,Mumbai,Maharashtra,diabetes,MH
2,54,F,Recovered,Bangalore,Karnataka,cardiovascular,KA
3,65,M,Recovered,Chennai,Chennai,cerebrovascular,TN
4,55,F,Recovered,Indore,Madhya Pradesh,diabetes,MP

In [19]:
death_recov_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Age             35 non-null     int64
 1   Gender          35 non-null     object
 2   Patient_status  35 non-null     object
 3   City            35 non-null     object
 4   State           35 non-null     object
 5   comorbidity     35 non-null     object
 6   State_code      35 non-null     object
dtypes: int64(1), object(6)
memory usage: 2.0+ KB

In [22]:
# convert column name to lower case

death_recov_df.columns = [column.lower() for column in death_recov_df.columns]
death_recov_df.head()

,age,gender,patient_status,city,state,comorbidity,state_code
0,70,M,Deceased,Mumbai,Maharashtra,diabetes,MH
1,85,M,Deceased,Mumbai,Maharashtra,diabetes,MH
2,54,F,Recovered,Bangalore,Karnataka,cardiovascular,KA
3,65,M,Recovered,Chennai,Chennai,cerebrovascular,TN
4,55,F,Recovered,Indore,Madhya Pradesh,diabetes,MP

In [23]:
death_recov_df.to_csv("../data/cleaned/cleaned_death_and_recovery.csv", index=False)